public class Main {
   public static void main(String[] args) {
      // Создадим массив чисел на 3 элемента.
      // Массив можно создать только с заранее указанным размером.
      int[] numbers = new int[3];

      // Запишем, что нулевой элемент массива это 15.
      // Нумерация в массивах всегда начинается с 0.
      numbers[0] = 15;

      // Выведем в консоль нулевой элемент массива.
      System.out.println(numbers[0]);

      // Выведем первый элемент.
      // Посмотри, что будет в консоли и подумай почему так вышло.
      System.out.println(numbers[1]);

      // Попробуй ниже записать новое значение для всех элементов массива.
      // Выведи их в консоль.
   }
}